In [1]:
import requests as requests
import pandas as pd
import json
import folium
from folium.plugins import MarkerCluster

In [2]:
df = pd.read_excel('Primary School.xlsx')

In [3]:
df.head()

                           Name
0      Admiralty Primary School
1  Ahmad Ibrahim Primary School
2                Ai Tong School
3      Alexandra Primary School
4   Anchor Green Primary School

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 179 entries, 0 to 178
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    179 non-null    object
dtypes: object(1)
memory usage: 1.5+ KB

In [5]:
df["Address"] =  "Singapore " + df["Name"]

In [6]:
df.head()

                           Name                                 Address
0      Admiralty Primary School      Singapore Admiralty Primary School
1  Ahmad Ibrahim Primary School  Singapore Ahmad Ibrahim Primary School
2                Ai Tong School                Singapore Ai Tong School
3      Alexandra Primary School      Singapore Alexandra Primary School
4   Anchor Green Primary School   Singapore Anchor Green Primary School

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 179 entries, 0 to 178
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     179 non-null    object
 1   Address  179 non-null    object
dtypes: object(2)
memory usage: 2.9+ KB

In [8]:
geo_s ='https://maps.googleapis.com/maps/api/geocode/json'
df["lat"] = ""
df["lng"] = ""


for i in range(len(df)):
    param = {'address': df["Address"][i], 'key': ''}

    response = requests.get(geo_s, params=param)

    json_dict = response.json()

    df["lat"][i] = json_dict['results'][0]['geometry']['location']['lat']
    df["lng"][i] = json_dict['results'][0]['geometry']['location']['lng']

In [9]:
df.head()

,Name,Address,lat,lng
0,Admiralty Primary School,Singapore Admiralty Primary School,1.443045,103.800309
1,Ahmad Ibrahim Primary School,Singapore Ahmad Ibrahim Primary School,1.433735,103.832782
2,Ai Tong School,Singapore Ai Tong School,1.360307,103.832706
3,Alexandra Primary School,Singapore Alexandra Primary School,1.291257,103.823764
4,Anchor Green Primary School,Singapore Anchor Green Primary School,1.390864,103.887118

In [10]:
df.to_csv("Preprocessed Pri School.csv")